# GetEntries Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..GetEntries Method
ColorFillScheme Class See Also
---
Retrieves copies of all entries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public IList<ColorFillSchemeEntry> GetEntries()
```

Visual Basic
---
```text
Public Function GetEntries As IList(Of ColorFillSchemeEntry)
```

Visual C++
---
```text
public:
IList<ColorFillSchemeEntry^>^ GetEntries()
```

# Remarks
This method recalculates entries based on the current parameter values of the elements colored by the scheme.
# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace